package com.cobaltumapps.simplecalculator.converterNavigation

object ConvertersValues {
    val weightValues = arrayOf(
        arrayOf(1.0, 1e3, 1e6, 1e9, 1e12, 1e15, 1e18),              // Микрограммы
        arrayOf(0.001, 1.0, 1000.0, 1e6, 1e9, 1e12, 1e15, 1e18),    // Миллиграммы
        arrayOf(1e-6, 1e-3, 1.0, 1e-1, 1e-2, 1e-3, 1e-6),           // Граммы
        arrayOf(1e-9, 1e-6, 1e-3, 1.0, 1e3, 1e6, 1e9, 1e12),        // Килограммы
        arrayOf(1e-12, 1e-9, 1e-6, 1e-3, 1.0, 1e3, 1e6, 1e9),       // Тонны
        arrayOf(1e-15, 1e-12, 1e-9, 1e-6, 1e-3, 1.0, 1e3, 1e6),     // Килотонны
        arrayOf(1e-18, 1e-15, 1e-12, 1e-9, 1e-6, 1e-3, 1.0))        // Мегатонны

    val lengthValues = arrayOf(
        arrayOf(1.0, 1000.0, 1e6, 1e7, 1e8, 1e9, 1e12),             // Нанометры
        arrayOf(0.001, 1.0, 1000.0, 1e4, 1e5, 1e6, 1e9),            // Микрометры
        arrayOf(1e-6, 1e-3, 1.0, 1e-1, 1e-2, 1e-3, 1e-6),           // Миллиметры
        arrayOf(1e-7, 1e-4, 1e-1, 1.0, 1e-1, 1e-2, 1e-5),           // Сантиметры
        arrayOf(1e-8, 1e-5, 1e-2, 1e-1, 1.0, 1e-1, 1e-4),           // Дециметры
        arrayOf(1e-9, 1e-6, 1e-3, 1e-2, 1e-1, 1.0, 1e-4),           // Метры
        arrayOf(1e-12, 1e-9, 1e-6, 1e-5, 1e-4, 1e-3, 1.0)           // Километры
    )
//    Доработать
    val timeValues = arrayOf(
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22),             // Пикосекунды
        arrayOf(1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20),                  // Наносекунды
        arrayOf(1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20),             // Миллисекунды
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22),             // Секунды
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22),             // Минуты
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22),             // Часы
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22),             // Дни
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22),             // Недели
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22),             // Года
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1.6e-14, 2.7e-16, 1.16e-17, 1.65e-18, 3.17e-20, 3.17e-22)              // Века
    )

    val speedValues = arrayOf(
        arrayOf(9.2656693110598e-10, 0.277778, 1.0, 0.000277778, 0.621371, 0.539957, 0.911344),                   // Км/ч (километры в час)
        arrayOf(1.4911649311738e-9, 0.44704, 1.609344, 0.00044704, 1.0, 0.00027, 0.868976),                       // Мл/ч (миль в час)
        arrayOf(3.3356409519815e-9, 1000.0, 3600.0, 1.0, 2236.9362920544, 1943.8444924574, 3280.84),              // Км/с (километры в секунду)
        arrayOf(5.3681937522257e-10, 83333.0, 5793.6384, 1.609344, 3600.0, 1.0, 3128.31447087),                   // Мл/с (миль в секунду)
        arrayOf(3.3356e-9, 1.0, 3.6, 1000.0, 2.23694, 1.94384, 3.28084),                                          // М/с (метры в секунду)
        arrayOf(1.7160019563934e-10, 0.5144, 1.851999999984, 0.000514, 1.1507794480136, 0.00031966095778156, 1.0),// Уз (узлы)
        arrayOf(1.0, 299792458.0, 1079252848.8, 299792.458, 670616629.3844, 186282.39705122, 582749918.36357)     // Скорость света (c=299 792 458)
    )

    val temperatureValue = arrayOf(
        arrayOf(1.0, (9.0 / 5.0), 273.15, 273.15 * 1.8, (4.0 / 5.0)),                   // Цельсий
        arrayOf((5.0 / 9.0), 1.0, 459.67 * (5.0 / 9.0), 459.67, (4.0 / 9.0)),           // Фаренгейт
        arrayOf(1.0, 9.0 / 5.0, 1.0, 9.0 / 5.0, 4.0 / 5.0),                             // Кельвин
        arrayOf((5.0 / 9.0), 1.0 - 459.67, 5.0 / 9.0, 1.0, 4.0 / 9.0),                  // Ранкин
        arrayOf(5.0 / 4.0, (9.0 / 4.0), 5.0 / 4.0 + 273.15, 9.0 / 4.0 + 491.67, 1.0)    // Реомюр
    )
    val volumeValues = arrayOf(
        arrayOf(1.0, 1e3, 1e6, 28320.0, 16.387, 3785.4),                                // Миллилитры
        arrayOf(1e-3, 1.0, 1e3, 28.317, (1 / 61.024), 3.7854),                          // Литры
        arrayOf(1e-6, 1e-3, 1.0, (1 / 35.315), (1 / 61020.0), (1 /  264.2)),            // Кубические метры
        arrayOf((1 / 28320.0), (1 / 28.317), 35.315, 1.0, (1 / 1728.0), (1 / 7.481)),   // Кубические футы
        arrayOf( (1 /16.3871), 61.024, 61020.0, 1728.0, 1.0, 231.0),                    // Кубические дюймы
        arrayOf((1 / 3785.0), (1 / 3.785), 264.2, 7.48, (1 / 231.0), 1.0)               // Американские галлоны
    )

    val areaValues = arrayOf(
        arrayOf(1.0, 1e-6, 1e-12, 1e-14, 1e-16, 1e-18, 1e-20, 1e-24),   // Нанометр^2
        arrayOf(1e6, 1.0, 1e-6, 1e-8, 1e-10, 1e-12, 1e-14, 1e-18),      // Микрометр^2
        arrayOf(1e12, 1e6, 1.0, 1e-2, 1e4, 1e-6, 1e-8, 1e-12),          // Миллиметр^2
        arrayOf(1e14, 1e9, 1e2, 1.0, 1e-2, 1e-4, 1e-6, 1e-10),          // Сантиметр^2
        arrayOf(1e16, 1e10, 1e4, 1e2, 1.0, 1e-2, 1e-4, 1e-8),           // Дециметр^2
        arrayOf(1e18, 1e12, 1e6, 1e4, 1e2, 1.0, 1e-2, 1e-6),            // Метр^2
        arrayOf(1e20, 1e14, 1e8, 1e6, 1e4, 1e2, 1.0, 1e-4),             // Декаметр^2
        arrayOf(1e24, 1e18, 1e12, 1e10, 1e8, 1e6, 1e4, 1.0)             // Километр^2
    )

    val frequencyValue = arrayOf(
        arrayOf(1.0, 1e3, 1e6, 1e9),           // Герц
        arrayOf(1e-3, 1.0, 1e3, 1e6),          // Килогерц
        arrayOf(1e-6, 1e-3, 1.0, 1e3),         // Мегагерц
        arrayOf(1e-9, 1e-6, 1e-3, 1.0)         // Гигагерц
    )

    val dataValues = arrayOf(
        arrayOf(1.0, 0.12, 1.25e-4, 1.25e-7, 1.25e-10, 1.25e-13, 1.25e-16, 1.25e-19, 1.25e-22, 1.25e-25),   // Бит
        arrayOf(8.0, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18, 1e-21, 1e-24),                             // Байт
        arrayOf(8e3, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18, 1e-21),                               // Килобайт
        arrayOf(8e6, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18),                                 // Мегабайт
        arrayOf(8e9, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15),                                   // Гигабайт
        arrayOf(8e12, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12),                                   // Терабайт
        arrayOf(8e15, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9),                                    // Петабайт
        arrayOf(8e18, 1e18, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6),                                    // Эксабайт
        arrayOf(8e21, 1e21, 1e18, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3),                                    // Зеттабайт
        arrayOf(8e24, 1e24, 1e21, 1e18, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0)                                     // Йоттабайт
    )
}