package com.cobaltumapps.simplecalculator.references

object ConvertersValues {
    val weightValues = arrayOf(
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18),              // Преобразования: μg -> μg, mg, g, kg, ton, kt, Mt
        arrayOf(1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18),         // Преобразования: mg -> μg, mg, g, kg, ton, kt, Mt
        arrayOf(1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12),                  // Преобразования: g -> μg, mg, g, kg, ton, kt, Mt
        arrayOf(1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12),             // Преобразования: kg -> μg, mg, g, kg, ton, kt, Mt
        arrayOf(1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9),              // Преобразования: ton -> μg, mg, g, kg, ton, kt, Mt
        arrayOf(1e15, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6),              // Преобразования: kt -> μg, mg, g, kg, ton, kt, Mt
        arrayOf(1e18, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0)                     // Преобразования: Mt -> μg, mg, g, kg, ton, kt, Mt
    )

    val lengthValues = arrayOf(
        arrayOf(1.0, 1e-3, 1e-6, 1e-7, 1e-8, 1e-9, 1e-12),              // Преобразования: nm -> nm, μm, mm, cm, dm, m, km
        arrayOf(1e3, 1.0, 1e-3, 1e-4, 1e-5, 1e-6, 1e-9),                // Преобразования: μm -> nm, μm, mm, cm, dm, m, km
        arrayOf(1e6, 1e3, 1.0, 1e-1, 1e-2, 1e-3, 1e-6),                 // Преобразования: mm -> nm, μm, mm, cm, dm, m, km
        arrayOf(1e7, 1e4, 1e1, 1.0, 1e-1, 1e-2, 1e-5),                  // Преобразования: cm -> nm, μm, mm, cm, dm, m, km
        arrayOf(1e8, 1e5, 1e2, 1e1, 1.0, 1e-1, 1e-4),                   // Преобразования: dm -> nm, μm, mm, cm, dm, m, km
        arrayOf(1e9, 1e6, 1e3, 1e2, 1e1, 1.0, 1e-3),                    // Преобразования: m -> nm, μm, mm, cm, dm, m, km
        arrayOf(1e12, 1e9, 1e6, 1e5, 1e4, 1e3, 1.0)                     // Преобразования: km -> nm, μm, mm, cm, dm, m, km
    )

    val timeValues = arrayOf(
        arrayOf(1.0, 1e-3, 1e-6, 1e-9, 1.66667e-11, 2.7778e-13, 1.1574e-14, 1.6534e-15, 3.8026e-16, 3.1689e-17, 3.1689e-19),    // Наносекунда
        arrayOf(1e3, 1.0, 1e-3, 1e-6, 1.6667e-8, 2.7778e-10, 1.1574e-11, 1.6534e-12, 3.8026e-13, 3.1689e-14, 3.1689e-16),       // Микросекунда
        arrayOf(1e6, 1e3, 1.0, 1e-3, 1e-6, 1.6667e-5, 2.7778e-7, 1.1574e-8, 1.6534e-9, 3.8026e-10, 3.1689e-11, 3.1689e-13),     // Миллисекунда
        arrayOf(1e9, 1e6, 1e3, 1.0, 0.0167, 0.0003, 1.1574e-5, 1.6534e-6, 3.8026e-7, 3.1689e-8, 3.1689e-10),                    // Секунда
        arrayOf(6e10, 6e7, 6e4, 60.0, 1.0, 0.0167, 0.0007, 9.9206e-5, 2.2816e-5, 1.9013e-6, 1.9013e-8),                         // Минута
        arrayOf(3.6e12, 3.6e9, 3.6e6, 3600.0, 60.0, 1.0, 0.0417, 0.006, 0.0014, 0.0001, 1.1408e-6),                             // Час
        arrayOf(8.64e13, 8.64e9, 8.64e6, 86400.0, 1440.0, 24.0, 1.0, 0.1429, 0.0329, 0.0027, 2.7379e-5),                        // День
        arrayOf(6.048e14, 6.048e11, 6.048e8, 604800.0, 10080.0, 168.0, 7.0, 1.0, 0.23, 0.0192, 0.0002),                         // Неделя
        arrayOf(2.6297e15, 2.6297e12, 26297446000.0, 2629746.0, 43829.1, 730.485, 30.4369, 4.3481, 1.0, 0.0833, 0.0008),        // Месяц
        arrayOf(3.1557e16, 3.1557e13, 31556952000.0, 31556952.0, 525949.2, 8765.82, 365.2425, 52.1775, 12.0, 1.0, 0.01),        // Год
        arrayOf(3.1557e18, 3.1557e15, 31557e12, 3155695200.0, 52594920.0, 876582.0, 36524.25, 5217.75, 1200.0, 100.0, 1.0)      // Век
    )

    val speedValues = arrayOf(
        arrayOf(1.0, 0.0003, 0.6214, 0.0002, 0.2778, 0.54, 9.2657e-10),                                     // Км в час
        arrayOf(3600.0, 1.0, 2236.9363, 0.6214, 1000.0, 1943.8445, 3.3356e-6),                              // Км в сек.
        arrayOf(1.6093, 0.0004, 1.0, 0.0003, 0.447, 0.869, 1.4912e-9),                                      // Миль в час
        arrayOf(5793.6384, 1.6093, 3600.0, 1.0, 1609.344, 3128.3145, 5.3682e-6),                            // Миль в сек.
        arrayOf(3.6, 0.0001, 2.2369, 0.0006, 1.0, 1.9438, 3.3356e-9),                                       // Метры в сек.
        arrayOf(1.852, 0.0005, 1.1508, 0.0003, 0.5144, 1.0, 1.7160e-9),                                     // Узлы
        arrayOf(1079252848.8, 299792.458, 670616629.3844, 186282.3971, 299792458.0, 582749918.3585, 1.0)      // Скорость света
    )

    // Внимание!! данные значения не используются, все вычисления происходят по спец. формулах в конвертере
    val temperatureValue = arrayOf(
        arrayOf(0.0, 0.0, 0.0, 0.0, 0.0),   // Цельсий
        arrayOf(0.0, 0.0, 0.0, 0.0, 0.0),   // Фаренгейт
        arrayOf(0.0, 0.0, 0.0, 0.0, 0.0),   // Кельвин
        arrayOf(0.0, 0.0, 0.0, 0.0, 0.0),   // Ранкин
        arrayOf(0.0, 0.0, 0.0, 0.0, 0.0)    // Реомюр
    )

    val volumeValues = arrayOf(
        arrayOf(1.0, 1e-3, 1e-6, 3.5315e-5, 0.061024, 2.6417e-4),                        // Миллилитры
        arrayOf(1e3, 1.0, 1e-3, 0.035315, 61.024, 0.26417),                              // Литры
        arrayOf(1e6, 1e3, 1.0, 35.315, 61024.0, 264.172),                                // Кубические метры
        arrayOf(28316.8466, 28.3168, 0.0283168, 1.0, 1728.0, 7.48052),                   // Кубические футы
        arrayOf(16.387, 1.6387e-2, 1.6387e-5, 5.787e-4, 1.0, 4.3290e-3),                 // Кубические дюймы
        arrayOf(3785.41, 3.78541, 3.78541e-3, 0.133681, 231.0, 1.0)                      // Американские галлоны
    )

    val areaValues = arrayOf(
        arrayOf(1.0, 1e-6, 1e-12, 1e-14, 1e-16, 1e-18, 1e-20, 1e-24),   // Нанометр^2
        arrayOf(1e6, 1.0, 1e-6, 1e-8, 1e-10, 1e-12, 1e-14, 1e-18),      // Микрометр^2
        arrayOf(1e12, 1e6, 1.0, 1e-2, 1e-4, 1e-6, 1e-8, 1e-12),          // Миллиметр^2
        arrayOf(1e14, 1e8, 1e2, 1.0, 1e-2, 1e-4, 1e-6, 1e-10),           // Сантиметр^2
        arrayOf(1e16, 1e10, 1e4, 1e2, 1.0, 1e-2, 1e-4, 1e-8),            // Дециметр^2
        arrayOf(1e18, 1e12, 1e6, 1e4, 1e2, 1.0, 1e-2, 1e-6),             // Метр^2
        arrayOf(1e20, 1e14, 1e8, 1e6, 1e4, 1e2, 1.0, 1e-4),              // Декаметр^2
        arrayOf(1e24, 1e18, 1e12, 1e10, 1e8, 1e6, 1e4, 1.0)              // Километр^2
    )

    val frequencyValues = arrayOf(
        arrayOf(1.0, 1e-3, 1e-6, 1e-9),  // Герц
        arrayOf(1e3, 1.0, 1e-3, 1e-6),   // Килогерц
        arrayOf(1e6, 1e3, 1.0, 1e-3),    // Мегагерц
        arrayOf(1e9, 1e6, 1e3, 1.0)      // Гигагерц
    )

    val dataValues = arrayOf(
        arrayOf(1.0, 0.125, 1.25e-4, 1.25e-7, 1.25e-10, 1.25e-13, 1.25e-16, 1.25e-19, 1.25e-22, 1.25e-25), // Бит
        arrayOf(8.0, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18, 1e-21, 1e-24),                           // Байт
        arrayOf(8e3, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18, 1e-21),                             // Килобайт
        arrayOf(8e6, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15, 1e-18),                               // Мегабайт
        arrayOf(8e9, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12, 1e-15),                                 // Гигабайт
        arrayOf(8e12, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9, 1e-12),                                 // Терабайт
        arrayOf(8e15, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6, 1e-9),                                  // Петабайт
        arrayOf(8e18, 1e18, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3, 1e-6),                                  // Эксабайт
        arrayOf(8e21, 1e21, 1e18, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0, 1e-3),                                  // Зеттабайт
        arrayOf(8e24, 1e24, 1e21, 1e18, 1e15, 1e12, 1e9, 1e6, 1e3, 1.0)                                   // Йоттабайт
    )

}